better diagram in web summary docs
